{"sections":{"471b345f-0b30-4c2a-ab9b-f3ff6bb48216":{"type":"image-banner","settings":{"image":"shopify:\/\/shop_images\/IMG_2353.jpg","image_overlay_opacity":0,"image_height":"medium","desktop_content_position":"middle-center","show_text_box":true,"desktop_content_alignment":"center","color_scheme":"","image_behavior":"none","mobile_content_alignment":"center","stack_images_on_mobile":true,"show_text_below":true}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":36,"padding_bottom":36}},"7811a59b-fe8b-4ae1-8e4b-00954b3e4c25":{"type":"rich-text","blocks":{"template--19523620471074__7811a59b-fe8b-4ae1-8e4b-00954b3e4c25-heading-1":{"type":"heading","settings":{"heading":"the small print","heading_size":"h1"}},"template--19523620471074__7811a59b-fe8b-4ae1-8e4b-00954b3e4c25-text-1":{"type":"text","settings":{"text":"<h5>Providing pleople (plant people) with a happy and healthy plant is of utmost importance to me, and I want you to be ecstatic upon receiving your order. I love talking to pleople (even if you’ve got a problem with your order) so please reach out with any concerns and I will do my best to help you and your new ward avoid the actual ‘death’s door’.<br\/><\/h5><h5><strong>Shipping<\/strong><\/h5><h5>I strive to get your plants to you as quickly as humanly possible. My processing time is 2-7 business days (but doesn’t usually take 7 days). I try to ship plant orders out Mondays and Tuesdays, but sometimes it bleeds into every other day except Sundays. Planters have no special day that I ship. <\/h5><h5>For plant orders November through March I recommend a heat pack, when it seems necessary in your state (of the country OR mind), and won’t guarantee the plants without one. <\/h5><h5><\/h5><h5><strong>Returns & Refunds<\/strong><\/h5><h5>I do not accept returns of plants as they will most likely not survive the return trip. <\/h5><h5>Unfortunately, even though all plants are healthy when they escape D.D., things can happen during their time in transit. If you open your package and are unhappy with the condition that your plant(s) showed up in, take a picture of it in the packaging and send me a detailed email. I want you to be fully satisfied with your order and will work to make you happy. I pack with extreme care but I cannot control USPS (no matter how hard I try). If they’ve played an extremely rough game of basketball with your package, and a planter is broken or plants smooshed we can file a claim and I will refund or replace as soon as I am reimbursed. <\/h5><h5>I offer provisional refunds or, if possible, replacement if the plant perishes within 2 days of receiving it or 7 days after shipment whichever is longer. Unfortunately I do not offer refunds for plants that did not survive your care, but I do offer sympathy and camaraderie, I’ve been there. If you are concerned about your plants’ health contact me ASAP. I will do my best to help guide you in any way I can. Trust my care advice at your own risk, I did name my company Death’s Door after all. <\/h5><h5><br\/><strong>Privacy Policy<\/strong><\/h5><h5>Listen, I’m on Shopify so I do <a href=\"https:\/\/www.shopify.com\/legal\/privacy\" target=\"_blank\" title=\"https:\/\/www.shopify.com\/legal\/privacy\">what they do<\/a>. As far as D.D. Succulents specifically I don’t share your info, I hoard it, like plants. I have your email address to send you updates on your order, and\/or the occasional D.D. news email, but if that’s too annoying just opt out, I’ll only be insulted for a few minutes. <\/h5>"}}},"block_order":["template--19523620471074__7811a59b-fe8b-4ae1-8e4b-00954b3e4c25-heading-1","template--19523620471074__7811a59b-fe8b-4ae1-8e4b-00954b3e4c25-text-1"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}}},"order":["471b345f-0b30-4c2a-ab9b-f3ff6bb48216","main","7811a59b-fe8b-4ae1-8e4b-00954b3e4c25"]}